{
  "format": "graph-model",
  "generatedBy": "2.7.0",
  "convertedBy": "TensorFlow.js Converter v3.11.0",
  "signature": {
    "inputs": {
      "input_1": {
        "name": "input_1:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            {
              "size": "-1"
            },
            {
              "size": "28"
            },
            {
              "size": "28"
            },
            {
              "size": "1"
            }
          ]
        }
      }
    },
    "outputs": {
      "dense": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            {
              "size": "-1"
            },
            {
              "size": "55"
            }
          ]
        }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/model/zero_padding2d/Pad/paddings",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "4"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/zero_padding2d_1/Pad/paddings",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "4"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block1_1_conv/separable_conv2d/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "64"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block2_1_conv/separable_conv2d/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "128"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block3_1_conv/separable_conv2d/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "128"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block4_1_conv/separable_conv2d/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "128"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block5_1_conv/separable_conv2d/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "128"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block6_1_conv/separable_conv2d/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "128"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/global_average_pooling2d/Mean/reduction_indices",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "64"
                  },
                  {
                    "size": "55"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "55"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "input_1",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {
              "dim": [
                {
                  "size": "-1"
                },
                {
                  "size": "28"
                },
                {
                  "size": "28"
                },
                {
                  "size": "1"
                }
              ]
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv1/conv/Conv2D_weights",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "7"
                  },
                  {
                    "size": "7"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "64"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv1/conv/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "64"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block6_1_conv/separable_conv2d_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "128"
                  },
                  {
                    "size": "128"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block1_1_conv/separable_conv2d_weights",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "64"
                  },
                  {
                    "size": "128"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block1_1_conv/separable_conv2d_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "128"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block6_1_conv/separable_conv2d_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "128"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block2_1_conv/separable_conv2d_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "128"
                  },
                  {
                    "size": "128"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block2_1_conv/separable_conv2d_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "128"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block3_1_conv/separable_conv2d_weights",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "128"
                  },
                  {
                    "size": "128"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/pooling_conv/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "128"
                  },
                  {
                    "size": "64"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block3_1_conv/separable_conv2d_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "128"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block4_1_conv/separable_conv2d_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "128"
                  },
                  {
                    "size": "128"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/pooling_conv/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "64"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block4_1_conv/separable_conv2d_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "128"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block5_1_conv/separable_conv2d_weights",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "128"
                  },
                  {
                    "size": "128"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block5_1_conv/separable_conv2d_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "128"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/zero_padding2d/Pad",
        "op": "Pad",
        "input": [
          "input_1",
          "StatefulPartitionedCall/model/zero_padding2d/Pad/paddings"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "Tpaddings": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv1/relu/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/model/zero_padding2d/Pad",
          "StatefulPartitionedCall/model/conv1/conv/Conv2D_weights",
          "StatefulPartitionedCall/model/conv1/conv/Conv2D_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "2",
                "2",
                "1"
              ]
            }
          },
          "epsilon": {
            "f": 0.0
          },
          "padding": {
            "s": "VkFMSUQ="
          },
          "num_args": {
            "i": "1"
          },
          "explicit_paddings": {
            "list": {}
          },
          "use_cudnn_on_gpu": {
            "b": true
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "fused_ops": {
            "list": {
              "s": [
                "Qmlhc0FkZA==",
                "UmVsdQ=="
              ]
            }
          },
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/zero_padding2d_1/Pad",
        "op": "Pad",
        "input": [
          "StatefulPartitionedCall/model/conv1/relu/Relu",
          "StatefulPartitionedCall/model/zero_padding2d_1/Pad/paddings"
        ],
        "attr": {
          "Tpaddings": {
            "type": "DT_INT32"
          },
          "T": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/pool1/MaxPool",
        "op": "MaxPool",
        "input": [
          "StatefulPartitionedCall/model/zero_padding2d_1/Pad"
        ],
        "attr": {
          "explicit_paddings": {
            "list": {}
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "2",
                "2",
                "1"
              ]
            }
          },
          "padding": {
            "s": "VkFMSUQ="
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "ksize": {
            "list": {
              "i": [
                "1",
                "3",
                "3",
                "1"
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block1_1_conv/separable_conv2d/depthwise",
        "op": "DepthwiseConv2dNative",
        "input": [
          "StatefulPartitionedCall/model/pool1/MaxPool",
          "StatefulPartitionedCall/model/conv2_block1_1_conv/separable_conv2d/ReadVariableOp"
        ],
        "attr": {
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "explicit_paddings": {
            "list": {}
          },
          "padding": {
            "s": "VkFMSUQ="
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block1_1_relu/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/model/conv2_block1_1_conv/separable_conv2d/depthwise",
          "StatefulPartitionedCall/model/conv2_block1_1_conv/separable_conv2d_weights",
          "StatefulPartitionedCall/model/conv2_block1_1_conv/separable_conv2d_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_args": {
            "i": "1"
          },
          "padding": {
            "s": "VkFMSUQ="
          },
          "epsilon": {
            "f": 0.0
          },
          "fused_ops": {
            "list": {
              "s": [
                "Qmlhc0FkZA==",
                "UmVsdQ=="
              ]
            }
          },
          "use_cudnn_on_gpu": {
            "b": true
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "explicit_paddings": {
            "list": {}
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block2_1_conv/separable_conv2d/depthwise",
        "op": "DepthwiseConv2dNative",
        "input": [
          "StatefulPartitionedCall/model/conv2_block1_1_relu/Relu",
          "StatefulPartitionedCall/model/conv2_block2_1_conv/separable_conv2d/ReadVariableOp"
        ],
        "attr": {
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "explicit_paddings": {
            "list": {}
          },
          "padding": {
            "s": "VkFMSUQ="
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block2_1_relu/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/model/conv2_block2_1_conv/separable_conv2d/depthwise",
          "StatefulPartitionedCall/model/conv2_block2_1_conv/separable_conv2d_weights",
          "StatefulPartitionedCall/model/conv2_block2_1_conv/separable_conv2d_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "fused_ops": {
            "list": {
              "s": [
                "Qmlhc0FkZA==",
                "UmVsdQ=="
              ]
            }
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "num_args": {
            "i": "1"
          },
          "epsilon": {
            "f": 0.0
          },
          "explicit_paddings": {
            "list": {}
          },
          "use_cudnn_on_gpu": {
            "b": true
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "padding": {
            "s": "VkFMSUQ="
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block3_1_conv/separable_conv2d/depthwise",
        "op": "DepthwiseConv2dNative",
        "input": [
          "StatefulPartitionedCall/model/conv2_block2_1_relu/Relu",
          "StatefulPartitionedCall/model/conv2_block3_1_conv/separable_conv2d/ReadVariableOp"
        ],
        "attr": {
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "explicit_paddings": {
            "list": {}
          },
          "padding": {
            "s": "VkFMSUQ="
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block3_1_relu/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/model/conv2_block3_1_conv/separable_conv2d/depthwise",
          "StatefulPartitionedCall/model/conv2_block3_1_conv/separable_conv2d_weights",
          "StatefulPartitionedCall/model/conv2_block3_1_conv/separable_conv2d_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "epsilon": {
            "f": 0.0
          },
          "use_cudnn_on_gpu": {
            "b": true
          },
          "fused_ops": {
            "list": {
              "s": [
                "Qmlhc0FkZA==",
                "UmVsdQ=="
              ]
            }
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "num_args": {
            "i": "1"
          },
          "explicit_paddings": {
            "list": {}
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "padding": {
            "s": "VkFMSUQ="
          },
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block4_1_conv/separable_conv2d/depthwise",
        "op": "DepthwiseConv2dNative",
        "input": [
          "StatefulPartitionedCall/model/conv2_block3_1_relu/Relu",
          "StatefulPartitionedCall/model/conv2_block4_1_conv/separable_conv2d/ReadVariableOp"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "padding": {
            "s": "VkFMSUQ="
          },
          "explicit_paddings": {
            "list": {}
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block4_1_relu/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/model/conv2_block4_1_conv/separable_conv2d/depthwise",
          "StatefulPartitionedCall/model/conv2_block4_1_conv/separable_conv2d_weights",
          "StatefulPartitionedCall/model/conv2_block4_1_conv/separable_conv2d_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "strides": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "padding": {
            "s": "VkFMSUQ="
          },
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "num_args": {
            "i": "1"
          },
          "explicit_paddings": {
            "list": {}
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "epsilon": {
            "f": 0.0
          },
          "use_cudnn_on_gpu": {
            "b": true
          },
          "fused_ops": {
            "list": {
              "s": [
                "Qmlhc0FkZA==",
                "UmVsdQ=="
              ]
            }
          },
          "data_format": {
            "s": "TkhXQw=="
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block5_1_conv/separable_conv2d/depthwise",
        "op": "DepthwiseConv2dNative",
        "input": [
          "StatefulPartitionedCall/model/conv2_block4_1_relu/Relu",
          "StatefulPartitionedCall/model/conv2_block5_1_conv/separable_conv2d/ReadVariableOp"
        ],
        "attr": {
          "padding": {
            "s": "VkFMSUQ="
          },
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "explicit_paddings": {
            "list": {}
          },
          "data_format": {
            "s": "TkhXQw=="
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block5_1_relu/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/model/conv2_block5_1_conv/separable_conv2d/depthwise",
          "StatefulPartitionedCall/model/conv2_block5_1_conv/separable_conv2d_weights",
          "StatefulPartitionedCall/model/conv2_block5_1_conv/separable_conv2d_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "num_args": {
            "i": "1"
          },
          "epsilon": {
            "f": 0.0
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "padding": {
            "s": "VkFMSUQ="
          },
          "use_cudnn_on_gpu": {
            "b": true
          },
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "explicit_paddings": {
            "list": {}
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "fused_ops": {
            "list": {
              "s": [
                "Qmlhc0FkZA==",
                "UmVsdQ=="
              ]
            }
          },
          "data_format": {
            "s": "TkhXQw=="
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block6_1_conv/separable_conv2d/depthwise",
        "op": "DepthwiseConv2dNative",
        "input": [
          "StatefulPartitionedCall/model/conv2_block5_1_relu/Relu",
          "StatefulPartitionedCall/model/conv2_block6_1_conv/separable_conv2d/ReadVariableOp"
        ],
        "attr": {
          "explicit_paddings": {
            "list": {}
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "padding": {
            "s": "VkFMSUQ="
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/conv2_block6_1_relu/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/model/conv2_block6_1_conv/separable_conv2d/depthwise",
          "StatefulPartitionedCall/model/conv2_block6_1_conv/separable_conv2d_weights",
          "StatefulPartitionedCall/model/conv2_block6_1_conv/separable_conv2d_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "strides": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "use_cudnn_on_gpu": {
            "b": true
          },
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "fused_ops": {
            "list": {
              "s": [
                "Qmlhc0FkZA==",
                "UmVsdQ=="
              ]
            }
          },
          "epsilon": {
            "f": 0.0
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "num_args": {
            "i": "1"
          },
          "padding": {
            "s": "VkFMSUQ="
          },
          "explicit_paddings": {
            "list": {}
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/pooling_relu/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/model/conv2_block6_1_relu/Relu",
          "StatefulPartitionedCall/model/pooling_conv/Conv2D_weights",
          "StatefulPartitionedCall/model/pooling_conv/Conv2D_bn_offset"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "explicit_paddings": {
            "list": {}
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "padding": {
            "s": "VkFMSUQ="
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "use_cudnn_on_gpu": {
            "b": true
          },
          "num_args": {
            "i": "1"
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "epsilon": {
            "f": 0.0
          },
          "dilations": {
            "list": {
              "i": [
                "1",
                "1",
                "1",
                "1"
              ]
            }
          },
          "fused_ops": {
            "list": {
              "s": [
                "Qmlhc0FkZA==",
                "UmVsdQ=="
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/pooling_pool/AvgPool",
        "op": "AvgPool",
        "input": [
          "StatefulPartitionedCall/model/pooling_relu/Relu"
        ],
        "attr": {
          "padding": {
            "s": "VkFMSUQ="
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "ksize": {
            "list": {
              "i": [
                "1",
                "2",
                "2",
                "1"
              ]
            }
          },
          "data_format": {
            "s": "TkhXQw=="
          },
          "strides": {
            "list": {
              "i": [
                "1",
                "2",
                "2",
                "1"
              ]
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/global_average_pooling2d/Mean",
        "op": "Mean",
        "input": [
          "StatefulPartitionedCall/model/pooling_pool/AvgPool",
          "StatefulPartitionedCall/model/global_average_pooling2d/Mean/reduction_indices"
        ],
        "attr": {
          "Tidx": {
            "type": "DT_INT32"
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "keep_dims": {
            "b": false
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/dense/BiasAdd",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/model/global_average_pooling2d/Mean",
          "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "epsilon": {
            "f": 0.0
          },
          "transpose_a": {
            "b": false
          },
          "transpose_b": {
            "b": false
          },
          "fused_ops": {
            "list": {
              "s": [
                "Qmlhc0FkZA=="
              ]
            }
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "num_args": {
            "i": "1"
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/model/dense/Softmax",
        "op": "Softmax",
        "input": [
          "StatefulPartitionedCall/model/dense/BiasAdd"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": [
          "StatefulPartitionedCall/model/dense/Softmax"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          }
        }
      }
    ],
    "library": {},
    "versions": {
      "producer": 898
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "mrz20220531.bin"
      ],
      "weights": [
        {
          "name": "StatefulPartitionedCall/model/zero_padding2d/Pad/paddings",
          "shape": [
            4,
            2
          ],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/model/zero_padding2d_1/Pad/paddings",
          "shape": [
            4,
            2
          ],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/model/conv2_block1_1_conv/separable_conv2d/ReadVariableOp",
          "shape": [
            1,
            1,
            64,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/conv2_block2_1_conv/separable_conv2d/ReadVariableOp",
          "shape": [
            1,
            1,
            128,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/conv2_block3_1_conv/separable_conv2d/ReadVariableOp",
          "shape": [
            1,
            1,
            128,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/conv2_block4_1_conv/separable_conv2d/ReadVariableOp",
          "shape": [
            1,
            1,
            128,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/conv2_block5_1_conv/separable_conv2d/ReadVariableOp",
          "shape": [
            1,
            1,
            128,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/conv2_block6_1_conv/separable_conv2d/ReadVariableOp",
          "shape": [
            1,
            1,
            128,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/global_average_pooling2d/Mean/reduction_indices",
          "shape": [
            2
          ],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp",
          "shape": [
            64,
            55
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp",
          "shape": [
            55
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/conv1/conv/Conv2D_weights",
          "shape": [
            7,
            7,
            1,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/conv1/conv/Conv2D_bn_offset",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/conv2_block6_1_conv/separable_conv2d_weights",
          "shape": [
            1,
            1,
            128,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/conv2_block1_1_conv/separable_conv2d_weights",
          "shape": [
            1,
            1,
            64,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/conv2_block1_1_conv/separable_conv2d_bn_offset",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/conv2_block6_1_conv/separable_conv2d_bn_offset",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/conv2_block2_1_conv/separable_conv2d_weights",
          "shape": [
            1,
            1,
            128,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/conv2_block2_1_conv/separable_conv2d_bn_offset",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/conv2_block3_1_conv/separable_conv2d_weights",
          "shape": [
            1,
            1,
            128,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/pooling_conv/Conv2D_weights",
          "shape": [
            1,
            1,
            128,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/conv2_block3_1_conv/separable_conv2d_bn_offset",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/conv2_block4_1_conv/separable_conv2d_weights",
          "shape": [
            1,
            1,
            128,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/pooling_conv/Conv2D_bn_offset",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/conv2_block4_1_conv/separable_conv2d_bn_offset",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/conv2_block5_1_conv/separable_conv2d_weights",
          "shape": [
            1,
            1,
            128,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/model/conv2_block5_1_conv/separable_conv2d_bn_offset",
          "shape": [
            128
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}
